Тест_ЗУП_31_КОРП/src/Catalogs/СтруктураЦелей/СтруктураЦелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураЦелей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОценки</name>
    <type>
      <types>EnumRef.СпособОценкиПоказателяЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницыШкалы</name>
    <type>
      <types>EnumRef.ТипыГраницыШкалыПоказателяЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбратнаяШкала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВводПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Суммируемый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРассчитыватьОтношениеПланаКФакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШкалаЗначений</name>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>DefinedType.ЗначениеПоказателяЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаЗадаетсяИнтервалом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалОценкиОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалОценкиДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/СпособОценкиПоказателяЭффективности/СпособОценкиПоказателяЭффективности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособОценкиПоказателяЭффективности</name>
  <enumValues>
    <name>ОтношениеФактическогоКПлановому</name>
  </enumValues>
  <enumValues>
    <name>ОтношениеПлановогоКФактическому</name>
  </enumValues>
  <enumValues>
    <name>ШкалаЗначений</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ТипыГраницыШкалыПоказателяЭффективности/ТипыГраницыШкалыПоказателяЭффективности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыГраницыШкалыПоказателяЭффективности</name>
  <enumValues>
    <name>ФактическоеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ОтношениеФактическогоКПлановому</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/СтруктураЦелей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если СпособОценки <> ПредопределенноеЗначение("Перечисление.СпособОценкиПоказателяЭффективности.ШкалаЗначений") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ШкалаЗначений");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ШкалаЗначений.Количество() = 0 Тогда
		НоваяСтрока = ШкалаЗначений.Добавить();
		НоваяСтрока.ЗначениеДо = КлючевыеПоказателиЭффективностиКлиентСервер.ЗначениеПоследнегоПорогаШкалы(ОбратнаяШкала);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ТребуетсяВводПлана = Не (ГраницыШкалы = ПредопределенноеЗначение("Перечисление.ТипыГраницыШкалыПоказателяЭффективности.ФактическоеЗначение"));
КонецПроцедуры

#КонецОбласти

#КонецЕсли
